//
// Momentan sind in dieser Datei noch einige Deutsche Texte, diese sind nur für den Moment, bis sie korrekt in Englisch geschrieben wurden.
//

//Für den Schlüssel-Status
"Invalid" = "Invalid";
"Revoked" = "Revoked";
"Expired" = "Expired";
"Disabled" = "Disabled";
Key_Is_OK = "OK";

//Für die Lösch-Dialoge
"Delete secret key only" = "Delete secret key only";
"Delete both" = "Delete both";
"Delete key" = "Delete key";
DeleteSecretKey_Title = "Delete secret key";
DeleteSecretKey_Msg = "Attempting to delete key %@, %@.\n\nYou are about to delete a secret key.  Once it is gone, you will no longer be able to decrypt messages that were encrypted to this key.  Are you sure you want to do this?";
DeleteKey_Title = "Delete key";
DeleteKey_Msg = "Attempting to delete key %@, %@.\n\nAre you sure you want to delete this key?";


//Für den Export, als standard Dateiname.
"untitled" = "untitled";


//Für die Schlüselsuche
"No keys Found" = "No keys Found";
"  %@ bit %@ key %@, created: %@\n\n" = "%@ bit %@ key %@, created: %@\n\n"; //Format für die gefundenen Schlüssel vom Server.


GenerateEntropy_Msg = "We need to generate a lot of random bytes. It is a good idea to perform some other action (type on the keyboard in an application, move the mouse, utilize the disks) during the prime generation; this gives the random number generator a better chance to gain enough entropy.";
GenerateSubkey_Msg = "Add subkey to the Key \"%@\", %@.";
GenerateUserID_Msg = "Add user ID to the Key \"%@\", %@.";
GenerateSignature_Msg = "Make signature for all user IDs of \"%@\", %@";
GenerateUidSignature_Msg = "Make signature for user ID \"%@\", %@";
ChangeExpirationDate_Msg = "Change expiration date of \"%@\", %@";
ChangeSubkeyExpirationDate_Msg = "Change expiration date of \"%@\", %@\nSubkey: %@";


//Meldungen wenn die Eingabe nicht korrekt war.
CheckError_NameToShort = "Name must be at least 5 characters long!";
CheckError_NameToLong = "Name is to long!";
CheckError_InvalidCharInName = "Invalid character in name!\n\"<\" and \">\" not allowed.";
CheckError_NameStartWithDigit = "Name may not start with a digit!";
CheckError_InvalidEmail = "Not a valid email address!";
CheckError_EmailToLong = "E-Mail address is to long!\nMax length is 254.";
CheckError_InvalidCharInComment = "Invalid character in comment!\n\"(\" and \")\" not allowed.";
CheckError_CommentToLong = "Comment is to long!";
CheckError_NoKeyID = "Please enter a valid key ID!";
CheckError_PassphraseMissmatch = "Your passphrases did not match!";


//Meldungen beim Start, wenn es Probleme gibt. 
GPGNotFound_Msg = "GPG2 not found!";
GPG1OnlyFound_Title = "GPG2 not found!";
GPG1OnlyFound_Msg = "Since at least GPG was found 1.4, most features should be available.";
GPGNotValid_Msg = "No valid GPG found!";
GPGInitError_Msg = "GPG could not be initialized!";
GPGAgentNotFound_Title = "gpg-agent not found!";
GPGAgentNotFound_Msg = "Without gpg-agent you can’t access passphrase protected keys.";
GPGAgentNotStart_Title = "gpg-agent could not be started!";
GPGAgentNotStart_Msg = "Without gpg-agent you can’t access passphrase protected keys.";
Quit_Button = "Quit";


//Sollte klar sein.
No = "No";
Error = "Error";
Warning = "Warning";
Cancle = "Cancle";


//Für die Importergebnis
"key %@: secret key imported\n" = "key %@: secret key imported\n";
"key %@: public key \"%@\" imported\n" = "key %@: public key \"%@\" imported\n";
"key %@: \"%@\" new user ID(s)\n" = "key %@: \"%@\" new user ID(s)\n";
"key %@: \"%@\" new signature(s)\n" = "key %@: \"%@\" new signature(s)\n";
"key %@: \"%@\" new subkey(s)\n" = "key %@: \"%@\" new subkey(s)\n";
"Nothing imported!" = "Nothing imported!";


//Die verschiedenen Algorithmen
GPG_RSAAlgorithm = "RSA";
GPG_RSAEncryptOnlyAlgorithm = "RSA-E";
GPG_RSASignOnlyAlgorithm = "RSA-S";
GPG_ElgamalEncryptOnlyAlgorithm = "ELG-E";
GPG_DSAAlgorithm = "DSA";
GPG_EllipticCurveAlgorithm = "EllipticCurve";
GPG_ECDSAAlgorithm = "ECDSA";
GPG_ElgamalAlgorithm = "ELG";
GPG_DiffieHellmanAlgorithm = "DiffieHellman";


//Im Hauptfenster.
"%i of %i keys listed" = "%i of %i keys listed";


